ME709FinalProject/blockMeshWeir/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.146;

vertices
(
    (0 0 0)			//point 0
    (2 0 0)			//point 1
    (4 0 0)			//point 2
    (12 0 0)			//point 3 
    (0 3 0)			//point 4
    (2 3 0)			//point 5
    (2.5 3 0)			//point 6
    (12 3 0)			//point 7
    (0 6 0)			//point 8
    (2 6 0)			//point 9 
    (4 6 0)			//point 10
    (12 6 0)			//point 11
    (0 0 4)			//point 12
    (2 0 4)			//point 13 
    (4 0 4)			//point 14
    (12 0 4)			//point 15
    (0 3 4)			//point 16
    (2 3 4)			//point 17
    (2.5 3 4)			//point 18
    (12 3 4)			//point 19
    (0 6 4)			//point 20
    (2 6 4)			//point 21
    (4 6 4)			//point 22
    (12 6 4)			//point 23
);

blocks
(
hex (0 1 5 4 12 13 17 16) (23 8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (19 8 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (23 42 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (4 42 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (19 42 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
            (2 3 15 14)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
